In [87]:
import pandas as pd

# Series

In [88]:
data = [1,2,3,4,5]

In [89]:
sr = pd.Series(data)

In [90]:
sr

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [91]:
index = ['Linha' + str(i) for i in range(5)]

In [92]:
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [93]:
sr =pd.Series(data = data, index = index)

In [94]:
sr

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [95]:
data = {'Linha' + str(i): i + 1 for i in range(5)}

In [96]:
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [97]:
sr = pd.Series(data)

In [98]:
sr

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

# DataFrame

In [99]:
data = [(1,2,3),
        (4,5,6),
        (7,8,9)]

In [100]:
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [101]:
df1 = pd.DataFrame(data)

In [102]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [103]:
index = ['Linha' + str(i) for i in range(3)]
index

['Linha0', 'Linha1', 'Linha2']

In [104]:
df1 = pd.DataFrame(data = data, index = index)
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [105]:
columns = ['Colunas' + str(i) for i in range (3)]
columns

['Colunas0', 'Colunas1', 'Colunas2']

In [106]:
df1 = pd.DataFrame(data = data, index = index, columns = columns)
df1

        Colunas0  Colunas1  Colunas2
Linha0         1         2         3
Linha1         4         5         6
Linha2         7         8         9

In [107]:
data = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [108]:
data

{'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [109]:
df2 = pd.DataFrame(data)

In [110]:
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [111]:
data = [[1,2,3],
        [4,5,6],
        [7,8,9]]

In [112]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [113]:
df3 = pd.DataFrame(data = data, index = index, columns = columns)
df3

        Colunas0  Colunas1  Colunas2
Linha0         1         2         3
Linha1         4         5         6
Linha2         7         8         9

In [114]:
df1[df1 > 0] = 'A'
df1

       Colunas0 Colunas1 Colunas2
Linha0        A        A        A
Linha1        A        A        A
Linha2        A        A        A

In [115]:
df2[df2 > 0] = 'B'
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [116]:
df3[df3 > 0] = 'C'
df3

       Colunas0 Colunas1 Colunas2
Linha0        C        C        C
Linha1        C        C        C
Linha2        C        C        C

In [119]:
df4 = pd.concat([df1,df2,df3])
df4

C:\Users\RamyS\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

       Coluna0 Coluna1 Coluna2 Colunas0 Colunas1 Colunas2
Linha0     NaN     NaN     NaN        A        A        A
Linha1     NaN     NaN     NaN        A        A        A
Linha2     NaN     NaN     NaN        A        A        A
Linha0       B       B       B      NaN      NaN      NaN
Linha1       B       B       B      NaN      NaN      NaN
Linha2       B       B       B      NaN      NaN      NaN
Linha0     NaN     NaN     NaN        C        C        C
Linha1     NaN     NaN     NaN        C        C        C
Linha2     NaN     NaN     NaN        C        C        C

In [120]:
df4 = pd.concat([df1,df2,df3], axis = 1)
df4

,Colunas0,Colunas1,Colunas2,Coluna0,Coluna1,Coluna2,Colunas0,Colunas1,Colunas2
Linha0,A,A,A,B,B,B,C,C,C
Linha1,A,A,A,B,B,B,C,C,C
Linha2,A,A,A,B,B,B,C,C,C

In [121]:
dados = [('A', 'B'), ('C', 'D')]
df = pd.DataFrame(dados, columns = ['L1', 'L2'],  index = ['C1', 'C2'])
df

   L1 L2
C1  A  B
C2  C  D